In [1]:
import pandas as pd
import numpy as np
import os

In [4]:
# ls data

# Q1-1

```
아래의 데이타를 이용하여 데이타프레임을 생성하여라.
name_list는 인덱스로 이용한다. 

data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']        
```


# Q1-2
```
2명의 데이타를 추가하여라. 

신머신	55	67	88
윤파이	90	100	90
```

# Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

# Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?


# Q1-5
```
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
```

In [4]:
# 1-1
data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
name_list = ['고길동','김희동','신윤지','이민호','박준희']

In [6]:
df = pd.DataFrame(data, index=name_list)
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90

In [10]:
# 1-2
df.loc['신머신'] = [55, 67, 88]
df.loc['윤파이'] = [90, 100, 90]
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90
신머신   55    67   88
윤파이   90   100   90

In [12]:
# 1-3
df['sci'] = [90, 45, 77, 90, 67, 90, 80]
df

     kor  math  eng  sci
고길동   40    70   80   90
김희동   55    55   95   45
신윤지   66    66  100   77
이민호   77    20   77   90
박준희   34    40   90   67
신머신   55    67   88   90
윤파이   90   100   90   80

In [19]:
# 1-4
print(df['eng'].mean())
df.where(df['eng'] > df['eng'].mean())

88.57142857142857

      kor   math    eng   sci
고길동   NaN    NaN    NaN   NaN
김희동  55.0   55.0   95.0  45.0
신윤지  66.0   66.0  100.0  77.0
이민호   NaN    NaN    NaN   NaN
박준희  34.0   40.0   90.0  67.0
신머신   NaN    NaN    NaN   NaN
윤파이  90.0  100.0   90.0  80.0

In [27]:
over_eng_mean = list(df[df['eng'] > df['eng'].mean()].index)

In [28]:
for i in over_eng_mean:
    print(i)

김희동
신윤지
박준희
윤파이

In [43]:
# 1-5
# 전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
# df['total'] = df['kor'] + df['math'] + df['eng'] + df['sci']
df['total'] = df.sum(axis=1)
# del df['total']
df

     kor  math  eng  sci  total
고길동   40    70   80   90    280
김희동   55    55   95   45    250
신윤지   66    66  100   77    309
이민호   77    20   77   90    264
박준희   34    40   90   67    231
신머신   55    67   88   90    300
윤파이   90   100   90   80    360

In [44]:
df['avg'] = round(df['total']/4, 2)
df

     kor  math  eng  sci  total    avg
고길동   40    70   80   90    280  70.00
김희동   55    55   95   45    250  62.50
신윤지   66    66  100   77    309  77.25
이민호   77    20   77   90    264  66.00
박준희   34    40   90   67    231  57.75
신머신   55    67   88   90    300  75.00
윤파이   90   100   90   80    360  90.00

In [48]:
result = df['avg'].mean()
result

71.21428571428571

In [57]:
df.loc[df['avg'] < result, 'pass'] = 'X'
df.loc[df['avg'] >= result, 'pass'] = 'O'

In [58]:
df

     kor  math  eng  sci  total    avg pass
고길동   40    70   80   90    280  70.00    X
김희동   55    55   95   45    250  62.50    X
신윤지   66    66  100   77    309  77.25    O
이민호   77    20   77   90    264  66.00    X
박준희   34    40   90   67    231  57.75    X
신머신   55    67   88   90    300  75.00    O
윤파이   90   100   90   80    360  90.00    O

## Q 2-1
아래의 리스트를 이용하여 df_student 데이타프레임을 생성하여라 

```
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]
```

In [59]:
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]

In [61]:
df_student = pd.DataFrame(student_list)
df_student

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abrabam           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuba         Economics  female
6   Jennifer  Computer Science  female
7     Edward  Computer Science    male
8       Sara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

## Q 2-2
df_student 데이타프레임의 인덱스를 std1 ~ std11 형태로 변경하여라

In [73]:
std_index = ['std' + str(i+1) for i in range(df_student.shape[0])]

In [75]:
df_student.index = std_index

In [76]:
df_student

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-3
df_student 데이타프레임에서 gender 컬럼이 female 값을 가진 데이타만 별도로 데이타프레임 df_student_female 로 생성하여라.

In [81]:
df_student_female = df_student[df_student['gender'] == 'female']
df_student_female

           name             major  gender
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-4
df_student_female 데이타프레임에서 name 컬럼을 인덱스로 설정하고 gender 컬럼을 삭제하여라

In [85]:
df_student_female.index = df_student_female['name']
df_student_female

              name             major  gender
name
Jenny        Jenny         Economics  female
Yuba          Yuba         Economics  female
Jennifer  Jennifer  Computer Science  female
Sara          Sara        Psychology  female
Wendy        Wendy         Economics  female
Sera          Sera        Psychology  female

In [89]:
df_student_female.drop(['name', 'gender'], axis=1)

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

## Q 2-5
df_student 데이타프레임에서 'Computer Science' 과를 제외한 나머지 데이타로 데이타프레임 df_student2를 생성하여라. 이때 인덱스는 name 컬럼으로 변경한다

In [101]:
df_student2 = df_student[df_student['major'] != 'Computer Science']
df_student2.index = df_student2['name']
df_student2 = df_student2.drop('name', axis=1)
df_student2

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

## Q 2-6
df_student2 에서 Brian, Sara의 데이타를 삭제하고 grade 컬럼을 추가하여라 

4.5, 4.0, 3.5, 4.0, 3.0

In [108]:
df_student2.drop(['Brian', 'Sara'], axis=0, inplace=True)

KeyError: "['Brian', 'Sara'] not found in axis"

In [110]:
df_student2['grade'] = [4.5, 4.0, 3.5, 4.0, 3.0]

In [111]:
df_student2

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-7
df_student2 데이타프레임에서 grade 컬럼명을 score로 변경하고 <br>
전체 컬럼 순서를 gender, score, major 순서로 변경하여라

In [112]:
df_student2['score'] = df_student2['grade']

In [117]:
df_student2.drop('grade', axis=1, inplace=True)

In [119]:
df_student2.columns = ['gender', 'score', 'major']

In [120]:
df_student2

             gender   score  major
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-8
df_student2.describe() 명령을 이용하여 아래와 같이 출력하여라

In [123]:
df_student2.describe().loc[['mean', '25%', '50%', '75%']]

      major
mean    3.8
25%     3.5
50%     4.0
75%     4.0

## Q3-1
```
아래의 CSV 파일을 df_weather 데이타프레임으로 생성하여라. 
이때 컬럼은 일시, 평균기온, 최고기온, 최저기온 으로만 한다 

기상온도_서울202012.csv

```

In [126]:
df_weather = pd.read_csv('data/기상온도_서울202012.csv', encoding='cp949', usecols=[2, 3, 5, 8])

In [127]:
df_weather

              일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0     1907-10-01     13.9     25.4      3.3
1     1907-11-01      5.3     21.3     -8.9
2     1907-12-01     -3.9      9.0    -20.1
3     1908-01-01     -3.5      6.2    -14.3
4     1908-02-01     -4.0      8.4    -15.8
...          ...      ...      ...      ...
1348         NaN      NaN      NaN      NaN
1349         NaN      NaN      NaN      NaN
1350         NaN      NaN      NaN      NaN
1351         NaN      NaN      NaN      NaN
1352         NaN      NaN      NaN      NaN

[1353 rows x 4 columns]

## Q3-2
```
df_weather 데이타프레임에서 결측값이 각 컬럼별로 몇개가 있는지 출력하여라 
```

In [129]:
df_weather.isnull().sum()

일시          8
평균기온(℃)    33
최고기온(℃)    33
최저기온(℃)    33
dtype: int64

In [130]:
df_weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1353 entries, 0 to 1352
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   일시       1345 non-null   object
 1   평균기온(℃)  1320 non-null   float64
 2   최고기온(℃)  1320 non-null   float64
 3   최저기온(℃)  1320 non-null   float64
dtypes: float64(3), object(1)
memory usage: 42.4+ KB

## Q3-3
```
df_weather 데이타프레임에서 '일시' 컬럼값이 결측값 NaN으로 지정된 데이타를 출력하여라 
```

In [136]:
df_weather.isnull()['일시'].sum()

8

In [140]:
df_weather[df_weather.isnull()['일시']].index

Index([1345, 1346, 1347, 1348, 1349, 1350, 1351, 1352], dtype='int64')

## Q3-4
```
df_weather 데이타프레임에서 행 모두의 값이 NaN이면 삭제하여라 
```

In [142]:
df_weather.dropna(how='all', inplace=True)

In [146]:
df_weather.isnull()['일시'].sum()

0

## Q3-5
```
df_weather 데이타프레임에서 결측값을 모두 0으로 변경하여라
```

In [147]:
df_weather.isnull().sum()

일시          0
평균기온(℃)    25
최고기온(℃)    25
최저기온(℃)    25
dtype: int64

In [149]:
df_weather.fillna(value=0, inplace=True)

In [150]:
df_weather.isnull().sum()

일시         0
평균기온(℃)    0
최고기온(℃)    0
최저기온(℃)    0
dtype: int64

In [151]:
df_weather

              일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0     1907-10-01     13.9     25.4      3.3
1     1907-11-01      5.3     21.3     -8.9
2     1907-12-01     -3.9      9.0    -20.1
3     1908-01-01     -3.5      6.2    -14.3
4     1908-02-01     -4.0      8.4    -15.8
...          ...      ...      ...      ...
1340  2020-08-01     26.5     34.5     21.5
1341  2020-09-01     21.4     29.5     13.6
1342  2020-10-01     14.3     23.6      3.2
1343  2020-11-01      8.0     20.0     -3.6
1344  2020-12-01     -0.2      9.4    -11.2

[1345 rows x 4 columns]

## Q3-6
```
df_weather 데이타프레임에서 '일시' 컬럼의 데이타형을 시계열 형태로 변경하고 인덱스로 설정하여라. 
```

In [152]:
df_weather['일시'].info()

<class 'pandas.core.series.Series'>
Index: 1345 entries, 0 to 1344
Series name: 일시
Non-Null Count  Dtype
--------------  -----
1345 non-null   object
dtypes: object(1)
memory usage: 21.0+ KB

In [156]:
df_weather.index = pd.to_datetime(df_weather['일시'], format='%Y-%m-%d')

In [161]:
df_weather.drop('일시', axis=1, inplace=True)

In [162]:
df_weather

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
1907-10-01     13.9     25.4      3.3
1907-11-01      5.3     21.3     -8.9
1907-12-01     -3.9      9.0    -20.1
1908-01-01     -3.5      6.2    -14.3
1908-02-01     -4.0      8.4    -15.8
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[1345 rows x 3 columns]

In [164]:
df_weather.dtypes

평균기온(℃)    float64
최고기온(℃)    float64
최저기온(℃)    float64
dtype: object

## Q3-7
```
df_weather 데이타프레임에서 2000 이후의 데이타만 출력하여라 
```

In [165]:
df_weather.loc['2000':]

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
2000-01-01     -2.1      9.9    -12.1
2000-02-01     -1.7      7.5    -11.6
2000-03-01      6.3     18.9     -4.8
2000-04-01     11.9     23.5      1.8
2000-05-01     17.5     30.5      7.9
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[252 rows x 3 columns]